//
// Created by kenhuang on 2019-12-02.
//

#include "Comparator.h"

/***********************************************************************************************************************
 *  私有方法
 **********************************************************************************************************************/
static void deinit(Comparator *self) {

}

/***********************************************************************************************************************
 *  公有方法
 **********************************************************************************************************************/
Comparator *Comparator_init(Comparator *self,
                            int (*compare)(Object* o1, Object* o2),
                            boolean (*equals)(Object* obj),
                            Comparator* (*reversed)(),
                            Comparator* (*thenComparing)(Comparator* other)) {
    if (Object_init((Object *) self)) {
        self->compare = compare;
        self->equals = equals;
        self->reversed = reversed;
        self->thenComparing = thenComparing;
    }
    return self;
}
/***********************************************************************************************************************
 *  静态方法
 **********************************************************************************************************************/
INTERFACE_STATIC_INIT(Comparator)
END